En este programa se juntarán las dos tablas de sancionados obtenidas tras extraer y transformar la información relevante de las lista en crudo. También se hará un análisis y depurado final para dejar preparada la tabla para:

- Procesado, aplicación de modelo ML y estudio de su calidad.
- Carga de la tabla en PowerBI para la generación de dashboards.

In [2]:
import pandas as pd

In [3]:
df_eeuu = pd.read_csv('datos_entrada_script_03/df_eeuu.csv').iloc[:,1:]
df_eeuu

,Name,EntityType,Address,Country,Origin,City
0,AEROCARIBBEAN AIRLINES,ENTERPRISE,NaN,CUBA,EEUU,HAVANA
1,"ANGLO-CARIBBEAN CO., LTD.",ENTERPRISE,"IBEX HOUSE, THE MINORIES",UNITED KINGDOM,EEUU,LONDON
2,BANCO NACIONAL DE CUBA,ENTERPRISE,ZWEIERSTRASSE 35,SWITZERLAND,EEUU,ZURICH
3,BANCO NACIONAL DE CUBA,ENTERPRISE,AVENIDA DE CONCHA ESPINA 8,SPAIN,EEUU,MADRID
4,BANCO NACIONAL DE CUBA,ENTERPRISE,"DAI-ICHI BLDG. 6TH FLOOR, 10-2 NIHOMBASHI, 2-C...",JAPAN,EEUU,TOKYO
...,...,...,...,...,...,...
15275,PIONEER SHIPMANAGEMENT PTE. LTD.,ENTERPRISE,"24-07, SHENTON HOUSE, 3, SHENTON WAY",SINGAPORE,EEUU,SINGAPORE
15276,GOLDEN WARRIOR SHIPPING CO. LIMITED,ENTERPRISE,"9TH FLOOR, BLOCK C, QINGDAO PLAZA, 381, DUNHUA...",CHINA,EEUU,QINGDAO
15277,GOLDEN WARRIOR SHIPPING CO. LIMITED,ENTERPRISE,"UNIT D, 16/F, ONE CAPITAL PLACE, 18 LUARD ROAD...",CHINA,EEUU,HONG KONG
15278,GLORY HARVEST,VESSEL,NaN,NaN,EEUU,NaN
15279,TORNADO CASH,ENTERPRISE,NaN,NaN,EEUU,NaN

In [4]:
df_ue = pd.read_csv('datos_entrada_script_03/df_ue.csv').iloc[:,1:]
df_ue

                                    Name City Country EntityType Origin
0              SADDAM HUSSEIN AL-TIKRITI  NaN     NaN     PERSON     UE
1                               ABOU ALI  NaN     NaN     PERSON     UE
2        QUSAY SADDAM HUSSEIN AL-TIKRITI  NaN     NaN     PERSON     UE
3      QOUSSAÏ SADDAM HUSSEIN AL-TIKRITI  NaN     NaN     PERSON     UE
4         UDAY SADDAM HUSSEIN AL-TIKRITI  NaN     NaN     PERSON     UE
...                                  ...  ...     ...        ...    ...
13381        ЄВГЕН ВIТАЛIЙОВИЧ БАЛИЦЬКИЙ  NaN     NaN     PERSON     UE
13382      YEVHEN VITALIIOVYCH BALYTSKIY  NaN     NaN     PERSON     UE
13383        ЕВГЕНИЙ ВИТАЛЬЕВИЧ БАЛИЦКИЙ  NaN     NaN     PERSON     UE
13384     YEVGENIY VITALIEVICH BALYTSKIY  NaN     NaN     PERSON     UE
13385     JEVGENIJ VITALJEVITJ BALITSKIJ  NaN     NaN     PERSON     UE

[13386 rows x 5 columns]

Juntamos las dos tablas:

In [9]:
sanctionlist = pd.concat([df_eeuu, df_ue]).reset_index(drop=True)

In [10]:
sanctionlist

,Name,EntityType,Address,Country,Origin,City
0,AEROCARIBBEAN AIRLINES,ENTERPRISE,NaN,CUBA,EEUU,HAVANA
1,"ANGLO-CARIBBEAN CO., LTD.",ENTERPRISE,"IBEX HOUSE, THE MINORIES",UNITED KINGDOM,EEUU,LONDON
2,BANCO NACIONAL DE CUBA,ENTERPRISE,ZWEIERSTRASSE 35,SWITZERLAND,EEUU,ZURICH
3,BANCO NACIONAL DE CUBA,ENTERPRISE,AVENIDA DE CONCHA ESPINA 8,SPAIN,EEUU,MADRID
4,BANCO NACIONAL DE CUBA,ENTERPRISE,"DAI-ICHI BLDG. 6TH FLOOR, 10-2 NIHOMBASHI, 2-C...",JAPAN,EEUU,TOKYO
...,...,...,...,...,...,...
28661,ЄВГЕН ВIТАЛIЙОВИЧ БАЛИЦЬКИЙ,PERSON,NaN,NaN,UE,NaN
28662,YEVHEN VITALIIOVYCH BALYTSKIY,PERSON,NaN,NaN,UE,NaN
28663,ЕВГЕНИЙ ВИТАЛЬЕВИЧ БАЛИЦКИЙ,PERSON,NaN,NaN,UE,NaN
28664,YEVGENIY VITALIEVICH BALYTSKIY,PERSON,NaN,NaN,UE,NaN
28665,JEVGENIJ VITALJEVITJ BALITSKIJ,PERSON,NaN,NaN,UE,NaN

In [12]:
sanctionlist.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28666 entries, 0 to 28665
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        28666 non-null  object
 1   EntityType  28666 non-null  object
 2   Address     8250 non-null   object
 3   Country     15210 non-null  object
 4   Origin      28666 non-null  object
 5   City        13313 non-null  object
dtypes: object(6)
memory usage: 1.3+ MB

In [11]:
print("La columna con la información del nombre de la entidad es 'Name'.\n")

print("Se trata de una variable categórica nominal con",
      len(sanctionlist['Name'].unique()),"valores únicos.\n")

print("Existen",sanctionlist['Name'].isnull().tolist().count(True),
      "valores nulos de un total de",len(sanctionlist),'valores.')

La columna con la información del nombre de la entidad es 'Name'.

Se trata de una variable categórica nominal con 23638 valores únicos.

Existen 0 valores nulos de un total de 28666 valores.

Los nombres repetidos se corresponden a sancionados presentes en varias ubicaciones. Por ejemplo, una empresa que desarrolle actividad comercial en varios países.

In [13]:
print("La columna con la información del tipo de entidad es 'EntityType'.\n")

print("Se trata de una variable categórica nominal con",
      len(sanctionlist['EntityType'].unique()),"valores únicos.\n")

print("Existen",sanctionlist['EntityType'].isnull().tolist().count(True),
      "valores nulos de un total de",len(sanctionlist),'valores.')

La columna con la información del tipo de entidad es 'EntityType'.

Se trata de una variable categórica nominal con 5 valores únicos.

Existen 0 valores nulos de un total de 28666 valores.

In [14]:
sanctionlist['EntityType'].unique()

array(['ENTERPRISE', 'INDIVIDUAL', 'VESSEL', 'AIRCRAFT', 'PERSON'],
      dtype=object)

Los sancionados de tipo 'PERSON' e 'INDIVIDUAL' realmente son el mismo tipo de sancionado. Se cambia el valor 'INDIVIDUAL' por 'PERSON' en todos los registros:

In [15]:
sanctionlist.replace({'INDIVIDUAL':'PERSON'},inplace=True)

In [16]:
sanctionlist['EntityType'].unique()

array(['ENTERPRISE', 'PERSON', 'VESSEL', 'AIRCRAFT'], dtype=object)

In [18]:
print("La columna con la información de la dirección es 'Address'.\n")

print("Se trata de una variable categórica nominal con",
      len(sanctionlist['Address'].unique()),
      "valores únicos.\n")

print("Existen",sanctionlist['Address'].isnull().tolist().count(True),
      "valores nulos de un total de",len(sanctionlist),"valores.")

La columna con la información de la dirección es 'Address'.

Se trata de una variable categórica nominal con 7119 valores únicos.

Existen 20416 valores nulos de un total de 28666 valores.

Hay muchos valores nulos porque no se tiene información de la dirección para la lista de la UE. Únicamente se conoce la dirección para algunos registros de la lista de EEUU.

In [19]:
print("La columna con la información del país es 'Country'.\n")

print("Se trata de una variable categórica nominal con",
      len(sanctionlist['Country'].unique()),
      "valores únicos.\n")

print("Existen",sanctionlist['Country'].isnull().tolist().count(True),
      "valores nulos de un total de",len(sanctionlist),"valores.")

La columna con la información del país es 'Country'.

Se trata de una variable categórica nominal con 191 valores únicos.

Existen 13456 valores nulos de un total de 28666 valores.

Hay bastantes valores nulos para el país. La mayoría procedentes de la lista de la UE.

In [21]:
print("La columna con la información de la lista de origen es 'Origin'.\n")

print("Se trata de una variable categórica nominal con",
      len(sanctionlist['Origin'].unique()),
      "valores únicos.\n")

print("Existen",sanctionlist['Origin'].isnull().tolist().count(True),
      "valores nulos de un total de",len(sanctionlist),"valores.")

La columna con la información de la lista de origen es 'Origin'.

Se trata de una variable categórica nominal con 2 valores únicos.

Existen 0 valores nulos de un total de 28666 valores.

In [22]:
print("La columna con la información de la ciudad es 'City'.\n")

print("Se trata de una variable categórica nominal con",
      len(sanctionlist['City'].unique()),
      "valores únicos.\n")

print("Existen",sanctionlist['City'].isnull().tolist().count(True),
      "valores nulos de un total de",len(sanctionlist),"valores.")

La columna con la información de la ciudad es 'City'.

Se trata de una variable categórica nominal con 2164 valores únicos.

Existen 15353 valores nulos de un total de 28666 valores.

Hay bastantes valores nulos para la ciudad. La mayoría procedentes de la lista de la UE.

Por último, se lleva el DataFrame concatenado a la carpeta 'datos_entrada_script_04_y_PowerBI' desde donde será leído por el programa de aplicación y evaluación del modelo ML y cargado en PowerBI para la generación del dashboard.

In [24]:
sanctionlist.to_csv('datos_entrada_script_04_y_PowerBI/sanctionlist.csv')

Dashboard:

- Ranking países sancionados
- Analizar diferencias entre proporciones EEUU y UE
- Ver si hay sancionados presentes en las dos listas.